import {ISUBDIRECTIONS_LIST} from "@root/types";

export const TITLE_MAIN = 'Агрегатор курсов';
export const SUBTITLE_MAIN = 'Сопоставляем онлайн-курсы по digital и IT. Мы — каталог каталог-отзовик курсов, подбирайте курсы по отзываам, цене, длительности и другим критериям!';
export const BUTTON_TEXT_MAIN = 'Начать';
export const DIRECTIONS_PAGE_TITLE = 'Выбирайте направление';

export const SUBDIRECTIONS_LIST: ISUBDIRECTIONS_LIST = {
    "разработка": [
        "ios разработка",
        "Алгоритмы",
        "Базы данных",
        "Бэкенд разработка",
        "Верстка HTML CSS",
        "Безопасность",
        "Мобильная разработка",
        "Программирование для детей",
        "Робототехника",
        "Тестирование",
        "Веб-разработка",
        "Разработка игр"
    ],
    "Дизайн": [
        "UX/UI",
        "Графический дизайн"
    ],
    "Английский язык": [
        "Английский для IT",
        "Английский для бизнеса"
    ],
    "Аналитика": [
        "Бизнес аналитка",
        "Аналитика данных",
        "Системная аналитика",
    ],
    "Управление": [
        "Product manager",
        "CEO"
    ]
}
